OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f87j94.h
#define _RPO34R0                0x01
#define _RPO34R1                0x02
#define _RPO34R2                0x04
#define _RPO34R3                0x08
#define _RPO35R0                0x10
#define _RPO35R1                0x20
#define _RPO35R2                0x40
#define _RPO35R3                0x80

//==============================================================================


//==============================================================================
//        RPOR36_37 Bits

extern __at(0x0E24) __sfr RPOR36_37;

typedef union
  {
  struct
    {
    unsigned RPO36R0            : 1;
    unsigned RPO36R1            : 1;
    unsigned RPO36R2            : 1;
    unsigned RPO36R3            : 1;
    unsigned RPO37R0            : 1;
    unsigned RPO37R1            : 1;
    unsigned RPO37R2            : 1;
    unsigned RPO37R3            : 1;
    };

  struct
    {
    unsigned RPO36R             : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned RPO37R             : 4;
    };
  } __RPOR36_37bits_t;

extern __at(0x0E24) volatile __RPOR36_37bits_t RPOR36_37bits;

#define _RPO36R0                0x01
#define _RPO36R1                0x02
#define _RPO36R2                0x04
#define _RPO36R3                0x08
#define _RPO37R0                0x10
#define _RPO37R1                0x20
#define _RPO37R2                0x40
#define _RPO37R3                0x80

//==============================================================================


//==============================================================================
//        RPOR38_39 Bits

extern __at(0x0E25) __sfr RPOR38_39;

typedef union
  {
  struct
    {
    unsigned RPO38R0            : 1;
    unsigned RPO38R1            : 1;
    unsigned RPO38R2            : 1;
    unsigned RPO38R3            : 1;
    unsigned RPO39R0            : 1;
    unsigned RPO39R1            : 1;
    unsigned RPO39R2            : 1;
    unsigned RPO39R3            : 1;
    };

  struct
    {
    unsigned RPO38R             : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned RPO39R             : 4;
    };
  } __RPOR38_39bits_t;

extern __at(0x0E25) volatile __RPOR38_39bits_t RPOR38_39bits;

#define _RPO38R0                0x01
#define _RPO38R1                0x02
#define _RPO38R2                0x04
#define _RPO38R3                0x08
#define _RPO39R0                0x10
#define _RPO39R1                0x20
#define _RPO39R2                0x40
#define _RPO39R3                0x80

//==============================================================================


//==============================================================================
//        RPOR40_41 Bits

extern __at(0x0E26) __sfr RPOR40_41;

typedef union
  {
  struct
    {
    unsigned RPO40R0            : 1;
    unsigned RPO40R1            : 1;
    unsigned RPO40R2            : 1;
    unsigned RPO40R3            : 1;
    unsigned RPO41R0            : 1;
    unsigned RPO41R1            : 1;
    unsigned RPO41R2            : 1;
    unsigned RPO41R3            : 1;
    };

  struct
    {
    unsigned RPO40R             : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned RPO41R             : 4;
    };
  } __RPOR40_41bits_t;

extern __at(0x0E26) volatile __RPOR40_41bits_t RPOR40_41bits;

#define _RPO40R0                0x01
#define _RPO40R1                0x02
#define _RPO40R2                0x04
#define _RPO40R3                0x08
#define _RPO41R0                0x10
#define _RPO41R1                0x20
#define _RPO41R2                0x40
#define _RPO41R3                0x80

//==============================================================================


//==============================================================================
//        RPOR42_43 Bits

extern __at(0x0E27) __sfr RPOR42_43;

typedef union
  {
  struct
    {
    unsigned RPO42R0            : 1;
    unsigned RPO42R1            : 1;
    unsigned RPO42R2            : 1;
    unsigned RPO42R3            : 1;
    unsigned RPO43R0            : 1;
    unsigned RPO43R1            : 1;
    unsigned RPO43R2            : 1;
    unsigned RPO43R3            : 1;
    };

  struct
    {
    unsigned RPO42R             : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned RPO43R             : 4;
    };
  } __RPOR42_43bits_t;

extern __at(0x0E27) volatile __RPOR42_43bits_t RPOR42_43bits;

#define _RPO42R0                0x01
#define _RPO42R1                0x02
#define _RPO42R2                0x04
#define _RPO42R3                0x08
#define _RPO43R0                0x10
#define _RPO43R1                0x20
#define _RPO43R2                0x40
#define _RPO43R3                0x80

//==============================================================================


//==============================================================================
//        RPOR44_45 Bits

extern __at(0x0E28) __sfr RPOR44_45;

typedef union
  {
  struct
    {
    unsigned RPO44R0            : 1;
    unsigned RPO44R1            : 1;
    unsigned RPO44R2            : 1;
    unsigned RPO44R3            : 1;
    unsigned RPO45R0            : 1;
    unsigned RPO45R1            : 1;
    unsigned RPO45R2            : 1;
    unsigned RPO45R3            : 1;
    };

  struct
    {
    unsigned RPO44R             : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned RPO45R             : 4;
    };
  } __RPOR44_45bits_t;

extern __at(0x0E28) volatile __RPOR44_45bits_t RPOR44_45bits;

#define _RPO44R0                0x01
#define _RPO44R1                0x02
#define _RPO44R2                0x04
#define _RPO44R3                0x08
#define _RPO45R0                0x10
#define _RPO45R1                0x20
#define _RPO45R2                0x40
#define _RPO45R3                0x80

//==============================================================================


//==============================================================================
//        RPOR46 Bits

extern __at(0x0E29) __sfr RPOR46;

typedef union
  {
  struct
    {
    unsigned RPO46R0            : 1;
    unsigned RPO46R1            : 1;
    unsigned RPO46R2            : 1;
    unsigned RPO46R3            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RPO46R             : 4;
    unsigned                    : 4;
    };
  } __RPOR46bits_t;

extern __at(0x0E29) volatile __RPOR46bits_t RPOR46bits;

#define _RPO46R0                0x01
#define _RPO46R1                0x02
#define _RPO46R2                0x04
#define _RPO46R3                0x08

//==============================================================================


//==============================================================================
//        RPINR0_1 Bits

