OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f87j94.h
extern __at(0x0E30) __sfr RPINR12_13;

typedef union
  {
  struct
    {
    unsigned SDI2R0             : 1;
    unsigned SDI2R1             : 1;
    unsigned SDI2R2             : 1;
    unsigned SDI2R3             : 1;
    unsigned SS2R0              : 1;
    unsigned SS2R1              : 1;
    unsigned SS2R2              : 1;
    unsigned SS2R3              : 1;
    };

  struct
    {
    unsigned SDI2R              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned SS2R               : 4;
    };
  } __RPINR12_13bits_t;

extern __at(0x0E30) volatile __RPINR12_13bits_t RPINR12_13bits;

#define _SDI2R0                 0x01
#define _SDI2R1                 0x02
#define _SDI2R2                 0x04
#define _SDI2R3                 0x08
#define _SS2R0                  0x10
#define _SS2R1                  0x20
#define _SS2R2                  0x40
#define _SS2R3                  0x80

//==============================================================================


//==============================================================================
//        RPINR14_15 Bits

extern __at(0x0E31) __sfr RPINR14_15;

typedef union
  {
  struct
    {
    unsigned FLT0R0             : 1;
    unsigned FLT0R1             : 1;
    unsigned FLT0R2             : 1;
    unsigned FLT0R3             : 1;
    unsigned ECCP1R0            : 1;
    unsigned ECCP1R1            : 1;
    unsigned ECCP1R2            : 1;
    unsigned ECCP1R3            : 1;
    };

  struct
    {
    unsigned FLT0R              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned ECCP1R             : 4;
    };
  } __RPINR14_15bits_t;

extern __at(0x0E31) volatile __RPINR14_15bits_t RPINR14_15bits;

#define _FLT0R0                 0x01
#define _FLT0R1                 0x02
#define _FLT0R2                 0x04
#define _FLT0R3                 0x08
#define _ECCP1R0                0x10
#define _ECCP1R1                0x20
#define _ECCP1R2                0x40
#define _ECCP1R3                0x80

//==============================================================================


//==============================================================================
//        RPINR16_17 Bits

extern __at(0x0E32) __sfr RPINR16_17;

typedef union
  {
  struct
    {
    unsigned ECCP2R0            : 1;
    unsigned ECCP2R1            : 1;
    unsigned ECCP2R2            : 1;
    unsigned ECCP2R3            : 1;
    unsigned ECCP3R0            : 1;
    unsigned ECCP3R1            : 1;
    unsigned ECCP3R2            : 1;
    unsigned ECCP3R3            : 1;
    };

  struct
    {
    unsigned ECCP2R             : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned ECCP3R             : 4;
    };
  } __RPINR16_17bits_t;

extern __at(0x0E32) volatile __RPINR16_17bits_t RPINR16_17bits;

#define _ECCP2R0                0x01
#define _ECCP2R1                0x02
#define _ECCP2R2                0x04
#define _ECCP2R3                0x08
#define _ECCP3R0                0x10
#define _ECCP3R1                0x20
#define _ECCP3R2                0x40
#define _ECCP3R3                0x80

//==============================================================================


//==============================================================================
//        RPINR18_19 Bits

extern __at(0x0E33) __sfr RPINR18_19;

typedef union
  {
  struct
    {
    unsigned IOC0R0             : 1;
    unsigned IOC0R1             : 1;
    unsigned IOC0R2             : 1;
    unsigned IOC0R3             : 1;
    unsigned IOC1R0             : 1;
    unsigned IOC1R1             : 1;
    unsigned IOC1R2             : 1;
    unsigned IOC1R3             : 1;
    };

  struct
    {
    unsigned IOC0R              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned IOC1R              : 4;
    };
  } __RPINR18_19bits_t;

extern __at(0x0E33) volatile __RPINR18_19bits_t RPINR18_19bits;

#define _IOC0R0                 0x01
#define _IOC0R1                 0x02
#define _IOC0R2                 0x04
#define _IOC0R3                 0x08
#define _IOC1R0                 0x10
#define _IOC1R1                 0x20
#define _IOC1R2                 0x40
#define _IOC1R3                 0x80

//==============================================================================


//==============================================================================
//        RPINR20_21 Bits

extern __at(0x0E34) __sfr RPINR20_21;

typedef union
  {
  struct
    {
    unsigned IOC2R0             : 1;
    unsigned IOC2R1             : 1;
    unsigned IOC2R2             : 1;
    unsigned IOC2R3             : 1;
    unsigned IOC3R0             : 1;
    unsigned IOC3R1             : 1;
    unsigned IOC3R2             : 1;
    unsigned IOC3R3             : 1;
    };

  struct
    {
    unsigned IOC2R              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned IOC3R              : 4;
    };
  } __RPINR20_21bits_t;

extern __at(0x0E34) volatile __RPINR20_21bits_t RPINR20_21bits;

#define _IOC2R0                 0x01
#define _IOC2R1                 0x02
#define _IOC2R2                 0x04
#define _IOC2R3                 0x08
#define _IOC3R0                 0x10
#define _IOC3R1                 0x20
#define _IOC3R2                 0x40
#define _IOC3R3                 0x80

//==============================================================================


//==============================================================================
//        RPINR22_23 Bits

extern __at(0x0E35) __sfr RPINR22_23;

typedef union
  {
  struct
    {
    unsigned IOC4R0             : 1;
    unsigned IOC4R1             : 1;
    unsigned IOC4R2             : 1;
    unsigned IOC4R3             : 1;
    unsigned IOC5R0             : 1;
    unsigned IOC5R1             : 1;
    unsigned IOC5R2             : 1;
    unsigned IOC5R3             : 1;
    };

  struct
    {
    unsigned IOC4R              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned IOC5R              : 4;
    };
  } __RPINR22_23bits_t;

extern __at(0x0E35) volatile __RPINR22_23bits_t RPINR22_23bits;

#define _IOC4R0                 0x01
#define _IOC4R1                 0x02
#define _IOC4R2                 0x04
#define _IOC4R3                 0x08
#define _IOC5R0                 0x10
#define _IOC5R1                 0x20
#define _IOC5R2                 0x40
#define _IOC5R3                 0x80

//==============================================================================


//==============================================================================
//        RPINR24_25 Bits

