OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f87j94.h
extern __at(0x0E41) volatile __RPINR46_47bits_t RPINR46_47bits;

#define _PBIO0R0                0x01
#define _PBIO0R1                0x02
#define _PBIO0R2                0x04
#define _PBIO0R3                0x08
#define _PBIO1R0                0x10
#define _PBIO1R1                0x20
#define _PBIO1R2                0x40
#define _PBIO1R3                0x80

//==============================================================================


//==============================================================================
//        RPINR48_49 Bits

extern __at(0x0E42) __sfr RPINR48_49;

typedef union
  {
  struct
    {
    unsigned PBIO2R0            : 1;
    unsigned PBIO2R1            : 1;
    unsigned PBIO2R2            : 1;
    unsigned PBIO2R3            : 1;
    unsigned PBIO3R0            : 1;
    unsigned PBIO3R1            : 1;
    unsigned PBIO3R2            : 1;
    unsigned PBIO3R3            : 1;
    };

  struct
    {
    unsigned PBIO2R             : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned PBIO3R             : 4;
    };
  } __RPINR48_49bits_t;

extern __at(0x0E42) volatile __RPINR48_49bits_t RPINR48_49bits;

#define _PBIO2R0                0x01
#define _PBIO2R1                0x02
#define _PBIO2R2                0x04
#define _PBIO2R3                0x08
#define _PBIO3R0                0x10
#define _PBIO3R1                0x20
#define _PBIO3R2                0x40
#define _PBIO3R3                0x80

//==============================================================================


//==============================================================================
//        RPINR50_51 Bits

extern __at(0x0E43) __sfr RPINR50_51;

typedef union
  {
  struct
    {
    unsigned PBIO4R0            : 1;
    unsigned PBIO4R1            : 1;
    unsigned PBIO4R2            : 1;
    unsigned PBIO4R3            : 1;
    unsigned PBIO5R0            : 1;
    unsigned PBIO5R1            : 1;
    unsigned PBIO5R2            : 1;
    unsigned PBIO5R3            : 1;
    };

  struct
    {
    unsigned PBIO4R             : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned PBIO5R             : 4;
    };
  } __RPINR50_51bits_t;

extern __at(0x0E43) volatile __RPINR50_51bits_t RPINR50_51bits;

#define _PBIO4R0                0x01
#define _PBIO4R1                0x02
#define _PBIO4R2                0x04
#define _PBIO4R3                0x08
#define _PBIO5R0                0x10
#define _PBIO5R1                0x20
#define _PBIO5R2                0x40
#define _PBIO5R3                0x80

//==============================================================================


//==============================================================================
//        RPINR52_53 Bits

extern __at(0x0E44) __sfr RPINR52_53;

typedef union
  {
  struct
    {
    unsigned PBIO6R0            : 1;
    unsigned PBIO6R1            : 1;
    unsigned PBIO6R2            : 1;
    unsigned PBIO6R3            : 1;
    unsigned PBIO7R0            : 1;
    unsigned PBIO7R1            : 1;
    unsigned PBIO7R2            : 1;
    unsigned PBIO7R3            : 1;
    };

  struct
    {
    unsigned PBIO6R             : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned PBIO7R             : 4;
    };
  } __RPINR52_53bits_t;

extern __at(0x0E44) volatile __RPINR52_53bits_t RPINR52_53bits;

#define _PBIO6R0                0x01
#define _PBIO6R1                0x02
#define _PBIO6R2                0x04
#define _PBIO6R3                0x08
#define _PBIO7R0                0x10
#define _PBIO7R1                0x20
#define _PBIO7R2                0x40
#define _PBIO7R3                0x80

//==============================================================================


//==============================================================================
//        ANCON3 Bits

extern __at(0x0E45) __sfr ANCON3;

typedef struct
  {
  unsigned ANSEL16              : 1;
  unsigned ANSEL17              : 1;
  unsigned ANSEL18              : 1;
  unsigned ANSEL19              : 1;
  unsigned ANSEL20              : 1;
  unsigned ANSEL21              : 1;
  unsigned ANSEL22              : 1;
  unsigned ANSEL23              : 1;
  } __ANCON3bits_t;

extern __at(0x0E45) volatile __ANCON3bits_t ANCON3bits;

#define _ANSEL16                0x01
#define _ANSEL17                0x02
#define _ANSEL18                0x04
#define _ANSEL19                0x08
#define _ANSEL20                0x10
#define _ANSEL21                0x20
#define _ANSEL22                0x40
#define _ANSEL23                0x80

//==============================================================================


//==============================================================================
//        ANCON2 Bits

extern __at(0x0E46) __sfr ANCON2;

typedef struct
  {
  unsigned ANSEL8               : 1;
  unsigned ANSEL9               : 1;
  unsigned ANSEL10              : 1;
  unsigned ANSEL11              : 1;
  unsigned ANSEL12              : 1;
  unsigned ANSEL13              : 1;
  unsigned ANSEL14              : 1;
  unsigned ANSEL15              : 1;
  } __ANCON2bits_t;

extern __at(0x0E46) volatile __ANCON2bits_t ANCON2bits;

#define _ANSEL8                 0x01
#define _ANSEL9                 0x02
#define _ANSEL10                0x04
#define _ANSEL11                0x08
#define _ANSEL12                0x10
#define _ANSEL13                0x20
#define _ANSEL14                0x40
#define _ANSEL15                0x80

//==============================================================================


//==============================================================================
//        ANCON1 Bits

extern __at(0x0E47) __sfr ANCON1;

typedef struct
  {
  unsigned ANSEL0               : 1;
  unsigned ANSEL1               : 1;
  unsigned ANSEL2               : 1;
  unsigned ANSEL3               : 1;
  unsigned ANSEL4               : 1;
  unsigned ANSEL5               : 1;
  unsigned ANSEL6               : 1;
  unsigned ANSEL7               : 1;
  } __ANCON1bits_t;

extern __at(0x0E47) volatile __ANCON1bits_t ANCON1bits;

#define _ANSEL0                 0x01
#define _ANSEL1                 0x02
#define _ANSEL2                 0x04
#define _ANSEL3                 0x08
#define _ANSEL4                 0x10
#define _ANSEL5                 0x20
#define _ANSEL6                 0x40
#define _ANSEL7                 0x80

//==============================================================================

extern __at(0x0E48) __sfr ADCBUF1;
extern __at(0x0E48) __sfr ADCBUF1L;
extern __at(0x0E49) __sfr ADCBUF1H;
extern __at(0x0E4A) __sfr ADCBUF2;
extern __at(0x0E4A) __sfr ADCBUF2L;
extern __at(0x0E4B) __sfr ADCBUF2H;
extern __at(0x0E4C) __sfr ADCBUF3;
extern __at(0x0E4C) __sfr ADCBUF3L;
extern __at(0x0E4D) __sfr ADCBUF3H;
extern __at(0x0E4E) __sfr ADCBUF4;
extern __at(0x0E4E) __sfr ADCBUF4L;
extern __at(0x0E4F) __sfr ADCBUF4H;
extern __at(0x0E50) __sfr ADCBUF5;
extern __at(0x0E50) __sfr ADCBUF5L;
extern __at(0x0E51) __sfr ADCBUF5H;
extern __at(0x0E52) __sfr ADCBUF6;
extern __at(0x0E52) __sfr ADCBUF6L;
extern __at(0x0E53) __sfr ADCBUF6H;
extern __at(0x0E54) __sfr ADCBUF7;
extern __at(0x0E54) __sfr ADCBUF7L;
extern __at(0x0E55) __sfr ADCBUF7H;
extern __at(0x0E56) __sfr ADCBUF8;
extern __at(0x0E56) __sfr ADCBUF8L;
extern __at(0x0E57) __sfr ADCBUF8H;
extern __at(0x0E58) __sfr ADCBUF9;
extern __at(0x0E58) __sfr ADCBUF9L;
extern __at(0x0E59) __sfr ADCBUF9H;
extern __at(0x0E5A) __sfr ADCBUF10;
extern __at(0x0E5A) __sfr ADCBUF10L;
extern __at(0x0E5B) __sfr ADCBUF10H;
extern __at(0x0E5C) __sfr ADCBUF11;
extern __at(0x0E5C) __sfr ADCBUF11L;
extern __at(0x0E5D) __sfr ADCBUF11H;
extern __at(0x0E5E) __sfr ADCBUF12;
extern __at(0x0E5E) __sfr ADCBUF12L;
extern __at(0x0E5F) __sfr ADCBUF12H;
extern __at(0x0E60) __sfr ADCBUF13;
extern __at(0x0E60) __sfr ADCBUF13L;
extern __at(0x0E61) __sfr ADCBUF13H;
extern __at(0x0E62) __sfr ADCBUF14;
extern __at(0x0E62) __sfr ADCBUF14L;
extern __at(0x0E63) __sfr ADCBUF14H;
extern __at(0x0E64) __sfr ADCBUF15;
extern __at(0x0E64) __sfr ADCBUF15L;
extern __at(0x0E65) __sfr ADCBUF15H;
extern __at(0x0E66) __sfr ADCBUF16;
extern __at(0x0E66) __sfr ADCBUF16L;
extern __at(0x0E67) __sfr ADCBUF16H;
extern __at(0x0E68) __sfr ADCBUF17;
extern __at(0x0E68) __sfr ADCBUF17L;
extern __at(0x0E69) __sfr ADCBUF17H;
extern __at(0x0E6A) __sfr ADCBUF18;
extern __at(0x0E6A) __sfr ADCBUF18L;
extern __at(0x0E6B) __sfr ADCBUF18H;
extern __at(0x0E6C) __sfr ADCBUF19;
extern __at(0x0E6C) __sfr ADCBUF19L;
extern __at(0x0E6D) __sfr ADCBUF19H;
extern __at(0x0E6E) __sfr ADCBUF20;
extern __at(0x0E6E) __sfr ADCBUF20L;
extern __at(0x0E6F) __sfr ADCBUF20H;
extern __at(0x0E70) __sfr ADCBUF21;
extern __at(0x0E70) __sfr ADCBUF21L;
extern __at(0x0E71) __sfr ADCBUF21H;
extern __at(0x0E72) __sfr ADCBUF22;
extern __at(0x0E72) __sfr ADCBUF22L;
extern __at(0x0E73) __sfr ADCBUF22H;
extern __at(0x0E74) __sfr ADCBUF23;
extern __at(0x0E74) __sfr ADCBUF23L;
extern __at(0x0E75) __sfr ADCBUF23H;
extern __at(0x0E76) __sfr ADCBUF24;
extern __at(0x0E76) __sfr ADCBUF24L;
extern __at(0x0E77) __sfr ADCBUF24H;
extern __at(0x0E78) __sfr ADCBUF25;
extern __at(0x0E78) __sfr ADCBUF25L;
extern __at(0x0E79) __sfr ADCBUF25H;

//==============================================================================
//        ADCTMUEN0L Bits

