OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f87j94.h
extern __at(0x0EE0) volatile __REFO1CON2bits_t REFO1CON2bits;

#define _RODIV0                 0x01
#define _RODIV1                 0x02
#define _RODIV2                 0x04
#define _RODIV3                 0x08
#define _RODIV4                 0x10
#define _RODIV5                 0x20
#define _RODIV6                 0x40
#define _RODIV7                 0x80

//==============================================================================


//==============================================================================
//        REFO1CON1 Bits

extern __at(0x0EE1) __sfr REFO1CON1;

typedef union
  {
  struct
    {
    unsigned ROSEL0             : 1;
    unsigned ROSEL1             : 1;
    unsigned ROSEL2             : 1;
    unsigned ROSEL3             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ROSEL              : 4;
    unsigned                    : 4;
    };
  } __REFO1CON1bits_t;

extern __at(0x0EE1) volatile __REFO1CON1bits_t REFO1CON1bits;

#define _ROSEL0                 0x01
#define _ROSEL1                 0x02
#define _ROSEL2                 0x04
#define _ROSEL3                 0x08

//==============================================================================


//==============================================================================
//        REFO1CON Bits

extern __at(0x0EE2) __sfr REFO1CON;

typedef struct
  {
  unsigned ACTIVE               : 1;
  unsigned DIVSWEN              : 1;
  unsigned                      : 1;
  unsigned ROSSLP               : 1;
  unsigned ROOE                 : 1;
  unsigned ROSIDL               : 1;
  unsigned                      : 1;
  unsigned ROON                 : 1;
  } __REFO1CONbits_t;

extern __at(0x0EE2) volatile __REFO1CONbits_t REFO1CONbits;

#define _ACTIVE                 0x01
#define _DIVSWEN                0x02
#define _ROSSLP                 0x08
#define _ROOE                   0x10
#define _ROSIDL                 0x20
#define _ROON                   0x80

//==============================================================================


//==============================================================================
//        MEMCON Bits

extern __at(0x0EE3) __sfr MEMCON;

typedef union
  {
  struct
    {
    unsigned WM0                : 1;
    unsigned WM1                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned WAIT0              : 1;
    unsigned WAIT1              : 1;
    unsigned                    : 1;
    unsigned EBDIS              : 1;
    };

  struct
    {
    unsigned WM                 : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 4;
    unsigned WAIT               : 2;
    unsigned                    : 2;
    };
  } __MEMCONbits_t;

extern __at(0x0EE3) volatile __MEMCONbits_t MEMCONbits;

#define _MEMCON_WM0             0x01
#define _MEMCON_WM1             0x02
#define _MEMCON_WAIT0           0x10
#define _MEMCON_WAIT1           0x20
#define _MEMCON_EBDIS           0x80

//==============================================================================


//==============================================================================
//        ODCON2 Bits

extern __at(0x0EEA) __sfr ODCON2;

typedef struct
  {
  unsigned ECCP3OD              : 1;
  unsigned CCP4OD               : 1;
  unsigned CCP5OD               : 1;
  unsigned CCP6OD               : 1;
  unsigned CCP7OD               : 1;
  unsigned CCP8OD               : 1;
  unsigned CCP9OD               : 1;
  unsigned CCP10OD              : 1;
  } __ODCON2bits_t;

extern __at(0x0EEA) volatile __ODCON2bits_t ODCON2bits;

#define _ECCP3OD                0x01
#define _CCP4OD                 0x02
#define _CCP5OD                 0x04
#define _CCP6OD                 0x08
#define _CCP7OD                 0x10
#define _CCP8OD                 0x20
#define _CCP9OD                 0x40
#define _CCP10OD                0x80

//==============================================================================


//==============================================================================
//        ODCON1 Bits

extern __at(0x0EEB) __sfr ODCON1;

typedef struct
  {
  unsigned SSP1OD               : 1;
  unsigned SSP2OD               : 1;
  unsigned USART1OD             : 1;
  unsigned USART2OD             : 1;
  unsigned USART3OD             : 1;
  unsigned USART4OD             : 1;
  unsigned ECCP1OD              : 1;
  unsigned ECCP2OD              : 1;
  } __ODCON1bits_t;

extern __at(0x0EEB) volatile __ODCON1bits_t ODCON1bits;

#define _SSP1OD                 0x01
#define _SSP2OD                 0x02
#define _USART1OD               0x04
#define _USART2OD               0x08
#define _USART3OD               0x10
#define _USART4OD               0x20
#define _ECCP1OD                0x40
#define _ECCP2OD                0x80

//==============================================================================


//==============================================================================
//        MDCARL Bits

extern __at(0x0EEC) __sfr MDCARL;

typedef union
  {
  struct
    {
    unsigned MDCL0              : 1;
    unsigned MDCL1              : 1;
    unsigned MDCL2              : 1;
    unsigned MDCL3              : 1;
    unsigned                    : 1;
    unsigned MDCLSYNC           : 1;
    unsigned MDCLPOL            : 1;
    unsigned MDCLODIS           : 1;
    };

  struct
    {
    unsigned MDCL               : 4;
    unsigned                    : 4;
    };
  } __MDCARLbits_t;

extern __at(0x0EEC) volatile __MDCARLbits_t MDCARLbits;

#define _MDCL0                  0x01
#define _MDCL1                  0x02
#define _MDCL2                  0x04
#define _MDCL3                  0x08
#define _MDCLSYNC               0x20
#define _MDCLPOL                0x40
#define _MDCLODIS               0x80

//==============================================================================


//==============================================================================
//        MDCARH Bits

extern __at(0x0EED) __sfr MDCARH;

typedef union
  {
  struct
    {
    unsigned MDCH0              : 1;
    unsigned MDCH1              : 1;
    unsigned MDCH2              : 1;
    unsigned MDCH3              : 1;
    unsigned                    : 1;
    unsigned MDCHSYNC           : 1;
    unsigned MDCHPOL            : 1;
    unsigned MDCHODIS           : 1;
    };

  struct
    {
    unsigned MDCH               : 4;
    unsigned                    : 4;
    };
  } __MDCARHbits_t;

extern __at(0x0EED) volatile __MDCARHbits_t MDCARHbits;

#define _MDCH0                  0x01
#define _MDCH1                  0x02
#define _MDCH2                  0x04
#define _MDCH3                  0x08
#define _MDCHSYNC               0x20
#define _MDCHPOL                0x40
#define _MDCHODIS               0x80

//==============================================================================


//==============================================================================
//        MDSRC Bits

extern __at(0x0EEE) __sfr MDSRC;

typedef union
  {
  struct
    {
    unsigned MDSRC0             : 1;
    unsigned MDSRC1             : 1;
    unsigned MDSRC2             : 1;
    unsigned MDSRC3             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned MDSODIS            : 1;
    };

  struct
    {
    unsigned MDSRC              : 4;
    unsigned                    : 4;
    };
  } __MDSRCbits_t;

extern __at(0x0EEE) volatile __MDSRCbits_t MDSRCbits;

#define _MDSRC0                 0x01
#define _MDSRC1                 0x02
#define _MDSRC2                 0x04
#define _MDSRC3                 0x08
#define _MDSODIS                0x80

//==============================================================================


//==============================================================================
//        MDCON Bits

extern __at(0x0EEF) __sfr MDCON;

typedef struct
  {
  unsigned MDBIT                : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned MDO                  : 1;
  unsigned MDOPOL               : 1;
  unsigned MDSLR                : 1;
  unsigned MDOE                 : 1;
  unsigned MDEN                 : 1;
  } __MDCONbits_t;

extern __at(0x0EEF) volatile __MDCONbits_t MDCONbits;

#define _MDBIT                  0x01
#define _MDO                    0x08
#define _MDOPOL                 0x10
#define _MDSLR                  0x20
#define _MDOE                   0x40
#define _MDEN                   0x80

//==============================================================================


//==============================================================================
//        PMD4 Bits

