OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f87j94.h
extern __at(0x0F54) volatile __PADCFG1bits_t PADCFG1bits;

#define _RLPU                   0x01
#define _RKPU                   0x02
#define _RJPU                   0x04
#define _RHPU                   0x08
#define _RGPU                   0x10
#define _RFPU                   0x20
#define _REPU                   0x40
#define _RDPU                   0x80

//==============================================================================


//==============================================================================
//        IOCN Bits

extern __at(0x0F55) __sfr IOCN;

typedef struct
  {
  unsigned IOCN0                : 1;
  unsigned IOCN1                : 1;
  unsigned IOCN2                : 1;
  unsigned IOCN3                : 1;
  unsigned IOCN4                : 1;
  unsigned IOCN5                : 1;
  unsigned IOCN6                : 1;
  unsigned IOCN7                : 1;
  } __IOCNbits_t;

extern __at(0x0F55) volatile __IOCNbits_t IOCNbits;

#define _IOCN0                  0x01
#define _IOCN1                  0x02
#define _IOCN2                  0x04
#define _IOCN3                  0x08
#define _IOCN4                  0x10
#define _IOCN5                  0x20
#define _IOCN6                  0x40
#define _IOCN7                  0x80

//==============================================================================


//==============================================================================
//        IOCP Bits

extern __at(0x0F56) __sfr IOCP;

typedef struct
  {
  unsigned IOCP0                : 1;
  unsigned IOCP1                : 1;
  unsigned IOCP2                : 1;
  unsigned IOCP3                : 1;
  unsigned IOCP4                : 1;
  unsigned IOCP5                : 1;
  unsigned IOCP6                : 1;
  unsigned IOCP7                : 1;
  } __IOCPbits_t;

extern __at(0x0F56) volatile __IOCPbits_t IOCPbits;

#define _IOCP0                  0x01
#define _IOCP1                  0x02
#define _IOCP2                  0x04
#define _IOCP3                  0x08
#define _IOCP4                  0x10
#define _IOCP5                  0x20
#define _IOCP6                  0x40
#define _IOCP7                  0x80

//==============================================================================


//==============================================================================
//        RTCCON2 Bits

extern __at(0x0F57) __sfr RTCCON2;

typedef union
  {
  struct
    {
    unsigned RTCSECSEL0         : 1;
    unsigned RTCSECSEL1         : 1;
    unsigned RTCCLKSEL0         : 1;
    unsigned RTCCLKSEL1         : 1;
    unsigned PWCSPRE            : 1;
    unsigned PWCCPRE            : 1;
    unsigned PWCPOL             : 1;
    unsigned PWCEN              : 1;
    };

  struct
    {
    unsigned RTCSECSEL          : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 2;
    unsigned RTCCLKSEL          : 2;
    unsigned                    : 4;
    };
  } __RTCCON2bits_t;

extern __at(0x0F57) volatile __RTCCON2bits_t RTCCON2bits;

#define _RTCSECSEL0             0x01
#define _RTCSECSEL1             0x02
#define _RTCCLKSEL0             0x04
#define _RTCCLKSEL1             0x08
#define _PWCSPRE                0x10
#define _PWCCPRE                0x20
#define _PWCPOL                 0x40
#define _PWCEN                  0x80

//==============================================================================

extern __at(0x0F58) __sfr ALRMVALL;
extern __at(0x0F59) __sfr ALRMVALH;

//==============================================================================
//        ALRMRPT Bits

extern __at(0x0F5A) __sfr ALRMRPT;

typedef struct
  {
  unsigned ARPT0                : 1;
  unsigned ARPT1                : 1;
  unsigned ARPT2                : 1;
  unsigned ARPT3                : 1;
  unsigned ARPT4                : 1;
  unsigned ARPT5                : 1;
  unsigned ARPT6                : 1;
  unsigned ARPT7                : 1;
  } __ALRMRPTbits_t;

extern __at(0x0F5A) volatile __ALRMRPTbits_t ALRMRPTbits;

#define _ARPT0                  0x01
#define _ARPT1                  0x02
#define _ARPT2                  0x04
#define _ARPT3                  0x08
#define _ARPT4                  0x10
#define _ARPT5                  0x20
#define _ARPT6                  0x40
#define _ARPT7                  0x80

//==============================================================================


//==============================================================================
//        ALRMCFG Bits

extern __at(0x0F5B) __sfr ALRMCFG;

typedef union
  {
  struct
    {
    unsigned ALRMPTR0           : 1;
    unsigned ALRMPTR1           : 1;
    unsigned AMASK0             : 1;
    unsigned AMASK1             : 1;
    unsigned AMASK2             : 1;
    unsigned AMASK3             : 1;
    unsigned CHIME              : 1;
    unsigned ALRMEN             : 1;
    };

  struct
    {
    unsigned ALRMPTR            : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 2;
    unsigned AMASK              : 4;
    unsigned                    : 2;
    };
  } __ALRMCFGbits_t;

extern __at(0x0F5B) volatile __ALRMCFGbits_t ALRMCFGbits;

#define _ALRMPTR0               0x01
#define _ALRMPTR1               0x02
#define _AMASK0                 0x04
#define _AMASK1                 0x08
#define _AMASK2                 0x10
#define _AMASK3                 0x20
#define _CHIME                  0x40
#define _ALRMEN                 0x80

//==============================================================================

extern __at(0x0F5C) __sfr RTCVALL;
extern __at(0x0F5D) __sfr RTCVALH;

//==============================================================================
//        RTCCAL Bits

extern __at(0x0F5E) __sfr RTCCAL;

typedef struct
  {
  unsigned CAL0                 : 1;
  unsigned CAL1                 : 1;
  unsigned CAL2                 : 1;
  unsigned CAL3                 : 1;
  unsigned CAL4                 : 1;
  unsigned CAL5                 : 1;
  unsigned CAL6                 : 1;
  unsigned CAL7                 : 1;
  } __RTCCALbits_t;

extern __at(0x0F5E) volatile __RTCCALbits_t RTCCALbits;

#define _CAL0                   0x01
#define _CAL1                   0x02
#define _CAL2                   0x04
#define _CAL3                   0x08
#define _CAL4                   0x10
#define _CAL5                   0x20
#define _CAL6                   0x40
#define _CAL7                   0x80

//==============================================================================


//==============================================================================
//        RTCCON1 Bits

extern __at(0x0F5F) __sfr RTCCON1;

typedef union
  {
  struct
    {
    unsigned RTCPTR0            : 1;
    unsigned RTCPTR1            : 1;
    unsigned RTCOE              : 1;
    unsigned HALFSEC            : 1;
    unsigned RTCSYNC            : 1;
    unsigned RTCWREN            : 1;
    unsigned                    : 1;
    unsigned RTCEN              : 1;
    };

  struct
    {
    unsigned RTCPTR             : 2;
    unsigned                    : 6;
    };
  } __RTCCON1bits_t;

extern __at(0x0F5F) volatile __RTCCON1bits_t RTCCON1bits;

#define _RTCPTR0                0x01
#define _RTCPTR1                0x02
#define _RTCOE                  0x04
#define _HALFSEC                0x08
#define _RTCSYNC                0x10
#define _RTCWREN                0x20
#define _RTCEN                  0x80

//==============================================================================


//==============================================================================
//        DMACON1 Bits

